Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བསྐལ་པ་གྲངས་མེད་པ་བརྒྱའི་བར་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པའི་ཡིད་ལ་བྱས་པས་བསྒོམ་པ་དེའི་བསོད་ནམས་ནི་ཆེས་མང་དུ་འཕེལ་གྱི། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་འཁོད་པ་དེ་དག་ཐམས་ཅད་སྦྱིན་པ་ལ་རབ་ཏུ་བཀོད་པ་དང་། ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་བཀོད་པ་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་རབ་ཏུ་བཀོད་པ་དང་།
en: Moreover, Subhūti, the merit of those who cultivate this perfection of wisdom with their attention focused on all-aspect omniscience for an instant, a day, a hundred days, a year, a hundred years, an eon, or any period from a hundred eons to a hundred countless eons, will increase manifold, more than it would by establishing in generosity all beings situated in world systems numerous as the grains of sand of the river Gaṅgā, or by establishing them in ethical discipline; by establishing them in meditative stability, wisdom, liberation, and seeing the wisdom of liberation; {Ki.

source: རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་བཀོད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ་རབ་ཏུ་བཀོད་པ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་རབ་ཏུ་བཀོད་པ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་རབ་ཏུ་བཀོད་པ་དང་། རང་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་པས་ནི་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: V: 108} or by establishing them in the fruit of entering the stream to nirvāṇa, by establishing them in the fruit of being destined for only one more rebirth, by establishing them in the fruit of no longer being subject to rebirth, by establishing them in arhatship, or by establishing them in individual enlightenment. “

source: གང་གིས་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་བསྟན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་བསྟན་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་།
en: If you ask why, those lord buddhas who have revealed the foundation of meritorious deeds that originate from generosity, who have revealed the foundation of meritorious deeds that emerge from the cultivation of ethical discipline, and who have revealed the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment have indeed emerged from this [perfection of wisdom]. “

source: དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་བསྟན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་འདི་ལས་བྱུང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དེ་ལྟར་བསྟན་པའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་དེ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱ་སྟེ།
en: One should know that bodhisattva great beings who are established in the perfection of wisdom, as revealed here, are irreversible.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། གང་ཐབས་མཁས་པ་འདི་དང་ལྡན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པས་དགོངས་པར་རིག་པར་བྱའོ།
en: One should know that the tathāgatas turn their enlightened intention toward bodhisattva great beings who possess this skill in means.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། དེ་ནི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་བསྙེན་བཀུར་བར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have honored many hundred billion trillions of buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། །དེ་ནི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have developed the roots of virtuous action.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། དེ་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have been favored by spiritual mentors.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པར་རིག་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: One should know that these bodhisattva great beings have practiced the six perfections.

source: དེ་ནི་སྟོང་པ་ཉིད་བཅུ་བཞི་ལ་བསྒོམས་པར་རིག་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི།
en: One should know that these bodhisattva great beings have cultivated the fourteen aspects of emptiness.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་བཅུ་རྩ་བདུན་ལ་བསྒོམས་པར་རིག་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: One should know that these bodhisattva great beings have cultivated the thirty-seven factors conducive to enlightenment.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་བསྒོམས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have cultivated the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ལ་བསྒོམས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have cultivated the ten powers [of the tathāgatas], the four fearlessnesses, and the four kinds of exact knowledge.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི། མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings possess the six extrasensory powers.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་གཞོན་ནུར་གྱུར་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have been crown princes.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི། བསམ་པ་ཡོངས་སུ་རྫོགས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have fulfilled their aspirations.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི། སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are inseparable from the perception of the buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི། དགེ་བའི་རྩ་བ་དང་མི་འབྲལ་བར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are inseparable from the roots of virtuous action.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་དང་མི་འབྲལ་བར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are inseparable from the buddhafields.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྤོབས་པ་མི་ཆོད་པ་དང་ལྡན་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings possess unbroken inspired speech.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་གཟུངས་རབ་ཏུ་ཐོབ་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have acquired the dhāraṇīs.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་གཟུངས་ཡོངས་སུ་རྫོགས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have perfected their physical form.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ལུང་བསྟན་པ་ཕུན་སུམ་ཚོགས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have been excellently endowed with prophetic declarations.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཆེད་དུ་བསམས་ཤིང་སྲིད་པ་འདོད་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings have voluntarily sought rebirth.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་རྣམ་པར་རྟོགས་པར་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in matters to be realized.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ལུང་བསྟན་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in prophetic declaration.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཡི་གེ་མེད་པ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in unwritten matters to be realized.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་སྤྱོད་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in the conduct of a bodhisattva.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བརྗོད་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in verbal expression.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བརྗོད་པ་མེད་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in the inexpressible.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་གཅིག་གི་ལྷག་པའི་ཚིག་ལ་མཁས་པ་དང་།
en: One should know that these bodhisattva great beings are expert in singular designations.

source: གཉིས་ཀྱི་ལྷག་པའི་ཚིག་ལ་མཁས་པ་དང་།
en: One should know that these bodhisattva great beings are expert in dual designations.

source: མང་པོའི་ལྷག་པའི་ཚིག་ལ་མཁས་པ་དང་།
en: One should know that these bodhisattva great beings are expert in plural designations.

source: བུད་མེད་ཀྱི་ལྷག་པའི་ཚིག་ལ་མཁས་པ་དང་། སྐྱེས་པའི་ལྷག་པའི་ཚིག་ལ་མཁས་པ་དང་། མ་ནིང་གི་ལྷག་པའི་ཚིག་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in feminine designations, expert in masculine designations, and expert in neuter designations.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།། །།
en: One should know that these bodhisattva great beings are expert in past, future, and present events. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་ཅུ་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་གཟུགས་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in physical forms.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in feelings, perceptions, formative predispositions, and consciousness.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in the sense fields, the sensory elements, and the links of dependent origination. {

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: Ki.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་མཁས་པར་རིག་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་།
en: V: 109} One should know that these bodhisattva great beings are expert in all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in [the goals], up to and including all-aspect omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་མྱ་ངན་ལས་འདས་པའི་བར་ལ་མཁས་པར་རིག་པར་བྱའོ། །ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཚན་ཉིད་ལ་མཁས་པར་རིག་པར་བྱའོ། །འདུས་བྱས་ཀྱི་མཚན་ཉིད་དང་། འདུས་མ་བྱས་ཀྱི་མཚན་ཉིད་དང་། དངོས་པོ་དང་དངོས་པོ་མེད་པ་དང་། བདག་གི་དངོས་པོ་དང་། གཞན་གྱི་དངོས་པོ་དང་།
en: One should know that these bodhisattva great beings are expert in [the goals], up to and including nirvāṇa.

source: འདུ་བ་དང་། འབྲལ་བ་དང་། འདུ་འབྲལ་དང་ལྡན་པ་དང་། མི་ལྡན་པ་དང་། ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in conditioned defining characteristics, unconditioned defining characteristics, entities, nonentities, intrinsic entities, extraneous entities, and in that which is conjoined, that which is disjoined, that which is both conjoined and disjoined, and that which is neither conjoined nor disjoined. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དེ་བཞིན་ཉིད་ལ་མཁས་པར་རིག་པར་བྱའོ། །མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་།
en: One should know that these bodhisattva great beings are expert in the real nature.

source: ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the unmistaken real nature, the one and only real nature, reality, the realm of phenomena, the abiding nature of reality, the maturity of all phenomena, the very limit of reality, and the inconceivable realm.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་རྒྱུ་དང་རྐྱེན་དང་། རྐྱེན་མེད་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in causes, conditions, and the absence of conditions.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་འདུས་བྱས་ཀྱི་ཁམས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་དང་། ཁམས་ཡོད་པ་དང་། ཁམས་མེད་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in conditioned elements, unconditioned elements, the presence of elements, and the absence of elements. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་གཟུགས་ཡིད་ལ་མི་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that these bodhisattva great beings are expert in not focusing attention on physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡིད་ལ་མི་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in not focusing attention on feelings, perceptions, formative predispositions, and consciousness.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡིད་ལ་མི་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: One should know that they are expert in not focusing attention on the sense fields, the sensory elements, and the links of dependent origination.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་བཅུ་རྩ་བདུན་ཡིད་ལ་མི་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: One should know that they are expert in not focusing attention on all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ཡིད་ལ་མི་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in not focusing attention on the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་མི་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in not focusing attention on the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡིད་ལ་མི་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in not focusing attention on [the goals], up to and including all-aspect omniscience. “

source: །གཟུགས་གཟུགས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the notion that physical forms are empty of physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the notion that feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and so forth].

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: One should know that they are expert in the notion that the sense fields, the sensory elements, and the links of dependent origination are empty of the links of dependent origination [and so forth].

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱིས་སྟོང་ངོ་། །ཞེས་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: One should know that they are expert in the notion that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are empty of the thirty-seven factors conducive to enlightenment [and so forth].

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are empty of the dhāraṇī gateways [and so forth].

source: །སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ།
en: One should know that they are expert in the notion that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are empty of the eighteen distinct qualities of the buddhas [and so forth].

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the notion that [the goals], up to and including unsurpassed, complete enlightenment, are empty of unsurpassed, complete enlightenment [and so forth]. {Ki.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་རབ་ཏུ་སྦྱངས་པའི་ལམ་དང་། རབ་ཏུ་མ་སྦྱངས་པའི་ལམ་དང་། སྐྱེ་བ་དང་འགག་པ་དང་གནས་པ་ལས་གཞན་དུ་འགྱུར་བ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: V: 110} One should know that these bodhisattva great beings are expert in the path of refinement, in the path of nonrefinement, and in arising, ceasing, changing, desire, hatred, and delusion.

source: །འདོད་ཆགས་མེད་པ་དང་ཞེ་སྡང་མེད་པ་དང་གཏི་མུག་མེད་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in nondesire, nonhatred, and nondelusion.

source: །ལྟ་བ་དང་ལྟ་བ་མེད་པ་དང་། ལོག་པར་ལྟ་བ་དང་། ལོག་པར་ལྟ་བ་མེད་པ་དང་། ལྟ་བ་ཐམས་ཅད་ཀྱི་བར་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in views, the absence of views, wrong views, the absence of wrong views, [and so forth], up to and including all views.

source: །མིང་ལ་མཁས་པར་རིག་པར་བྱའོ། །མིང་དང་གཟུགས་དང་། དམིགས་པ་དང་། བདག་པོ་དང་རྣམ་པ་དང་།
en: One should know that they are expert in [the aggregates of] name and form, in objects of reference, in predominant [conditions], in aspects, and in defining characteristics. “

source: མཚན་ཉིད་ལ་མཁས་པར་རིག་པར་བྱའོ། །སྡུག་བསྔལ་དང་། ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in [the truths of the noble ones of] suffering, the cause [of suffering], the cessation [of suffering] and the path [that leads to the cessation of suffering].

source: །སེམས་ཅན་དམྱལ་བ་དང་། སེམས་ཅན་དམྱལ་བའི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the hells and the path [that leads] to the hells.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the animal realm and the path [that leads] to the animal realm.

source: །གཤིན་རྗེའི་འཇིག་རྟེན་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the world of Yama and the path [that leads] to the world of Yama.

source: །མི་དང་། མིའི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the human realm and the path [that leads] to the human realm.

source: །མི་མ་ཡིན་པ་དང་། མི་མ་ཡིན་པའི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the nonhuman realm and the path [that leads] to the nonhuman realm.

source: །ལྷ་དང་ལྷའི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the god realms and the path [that leads] to the god realms.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the fruit of entering the stream to nirvāṇa and the path [that leads] to the fruit of entering the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུའི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the fruit of being destined for only one more rebirth and the path [that leads] to the fruit of being destined for only one more rebirth.

source: །ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་ཕྱིར་མི་འོང་བའི་འབྲས་བུའི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in the fruit of no longer being subject to rebirth and the path [that leads] to the fruit of no longer being subject to rebirth.

source: །དགྲ་བཅོམ་པ་ཉིད་དང་། དགྲ་བཅོམ་པའི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in arhatship and the path [that leads] to arhatship.

source: །རང་བྱང་ཆུབ་དང་རང་བྱང་ཆུབ་ཀྱི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in individual enlightenment and the path [that leads] to individual enlightenment.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in knowledge of the path and the path [that leads] to knowledge of the path.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ལ་མཁས་པར་རིག་པར་བྱའོ། །དབང་པོ་ལ་མཁས་པ་དང་།
en: One should know that they are expert in all-aspect omniscience and the path [that leads] to all-aspect omniscience. “

source: དབང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་མཁས་པར་རིག་པར་བྱའོ། །ཤེས་རབ་མྱུར་བ་དང་།
en: One should know that they are expert in the sense faculties and in the perfection of the sense faculties.

source: ཤེས་རབ་རྣོ་བ་དང་། ཤེས་རབ་མགྱོགས་པ་དང་། ངེས་པར་འབྱེད་པའི་ཤེས་རབ་དང་། ཡངས་པའི་ཤེས་རབ་དང་། མི་མཉམ་པ་དང་མཉམ་པའི་ཤེས་རབ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in swift wisdom, sharp wisdom, fast wisdom, definitive wisdom, vast wisdom, and wisdom that is equal to the unequaled.

source: །འདས་པའི་དུས་དང་མ་འོངས་པའི་དུས་དང་། ད་ལྟར་བྱུང་བའི་དུས་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in past time, future time, and present time.

source: །ཐབས་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in methods.

source: །སེམས་ཅན་གྱི་སེམས་དང་བསམ་པ་དང་། ལྷག་པའི་བསམ་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in [understanding] the minds of beings, their resolve, and their aspirations.
